src/test/resources/org/apache/servicemix/http/addressing-request.xml

<soap:Envelope xmlns:soap='http://www.w3.org/2003/05/soap-envelope'
               xmlns:wsa='http://schemas.xmlsoap.org/ws/2003/03/addressing'
               xmlns:test='http://test'>
  <soap:Header>
    <wsa:To>http://test/MyConsumerService/myConsumer</wsa:To>
    <wsa:ReplyTo>
      <wsa:ServiceName>test:MyConsumerService</wsa:ServiceName>
    </wsa:ReplyTo>
  </soap:Header>
  <soap:Body>
    <echo xmlns='http://test'>
      <echoin0>world</echoin0>
    </echo>
  </soap:Body>
</soap:Envelope>
